rainer20512/stm32-fw/stm32l4/Src/system/clockconfig.c
/* Public functions ---------------------------------------------------------*/

/**
  * @brief  System Clock Configuration on MSI-Base
  *         The system Clock is configured as follow : 
  *            System Clock source            = MSI
  *            SYSCLK(Hz)                     = 100kHz ... 48MHz, depending from range
  *            HCLK(Hz)                       = 100kHz ... 48MHz, depending from range
  *            AHB Prescaler                  = 1
  *            APB1 Prescaler                 = 1
  *            APB2 Prescaler                 = 1
  *            Flash Latency(WS)              = depending from SYSCLK
  *            Main regulator output voltage  = Range 2, preferred, Range 1 when SYSCLK > 26 Mhz
  * @param range - One of RCC_MSIRANGE0 ... RCC_MSIRANGE_11
  *            RCC_MSIRANGE_0: range 0 around 100 kHz, 0 WS, Vcore Range 2  
  *            RCC_MSIRANGE_1: range 1 around 200 kHz, 0 WS, Vcore Range 2  
  *            RCC_MSIRANGE_2: range 2 around 400 kHz, 0 WS, Vcore Range 2  
  *            RCC_MSIRANGE_3: range 3 around 800 kHz, 0 WS, Vcore Range 2  
  *            RCC_MSIRANGE_4: range 4 around 1 MHz, 0 WS, Vcore Range 2  
  *            RCC_MSIRANGE_5: range 5 around 2 MHz, 0 WS, Vcore Range 2  
  *            RCC_MSIRANGE_6: range 6 around 4 MHz, 0 WS, Vcore Range 2   (reset value)
  *            RCC_MSIRANGE_7: range 6 around 8 MHz, 1 WS, Vcore Range 2  
  *            RCC_MSIRANGE_8: range 6 around 16 MHz, 2 WS, Vcore Range 2  
  *            RCC_MSIRANGE_9: range 6 around 24 MHz, 3 WS, Vcore Range 2   
  *            RCC_MSIRANGE_10: range 6 around 32 MHz, 1 WS, Vcore Range 1, NOT ALLOWED HERE
  *            RCC_MSIRANGE_11: range 6 around 48 MHz, 2 WS  Vcore Range 1, NOT ALLOWED HERE
  * @retval None
  */
static void SystemClock_MSI_Vrange_2(uint32_t msi_range)
{
  uint32_t flash_latency=FLASH_LATENCY_0;

  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  
  /* Enable MSI Oscillator */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_MSI;
  RCC_OscInitStruct.MSIState = RCC_MSI_ON;
  RCC_OscInitStruct.MSIClockRange = msi_range;
  RCC_OscInitStruct.MSICalibrationValue=0x00;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct)!= HAL_OK)
  {
    /* Initialization Error */
    while(1); 
  }
  switch ( msi_range ) {
    case RCC_MSIRANGE_7: flash_latency=FLASH_LATENCY_1; break;
    case RCC_MSIRANGE_8: flash_latency=FLASH_LATENCY_2; break;
    case RCC_MSIRANGE_9: flash_latency=FLASH_LATENCY_3; break;
    case RCC_MSIRANGE_10:
    case RCC_MSIRANGE_11:
      Error_Handler(__FILE__, __LINE__);
      break;
  }
  /* Select MSI as system clock source and configure the HCLK, PCLK1 and PCLK2 
     clocks dividers */
  RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_MSI;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;  
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;  
  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, flash_latency)!= HAL_OK)
  {
    /* Initialization Error */
    while(1); 
  }
  /* Enable Power Control clock */
  __HAL_RCC_PWR_CLK_ENABLE();
  
  /* The voltage scaling allows optimizing the power consumption when the device is 
     clocked below the maximum system frequency, to update the voltage scaling value 
     regarding system frequency refer to product datasheet.  */
  HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE2);
  
  /* Disable Power Control clock */
  __HAL_RCC_PWR_CLK_DISABLE();
  
  /* Select MSI as WakeUp clock */
  CLEAR_BIT(RCC->CFGR, RCC_CFGR_STOPWUCK_Msk);

}

/**
  * @brief  System Clock Configuration on MSI-Base
  *         The system Clock is configured as follow : 
  *            System Clock source            = MSI
  *            SYSCLK(Hz)                     = 100kHz ... 48MHz, depending from range
  *            HCLK(Hz)                       = 100kHz ... 48MHz, depending from range
  *            AHB Prescaler                  = 1
  *            APB1 Prescaler                 = 1
  *            APB2 Prescaler                 = 1
  *            Flash Latency(WS)              = depending from SYSCLK
  *            Main regulator output voltage  = always Range 1
  * @param range - One of RCC_MSIRANGE0 ... RCC_MSIRANGE_11
  *            RCC_MSIRANGE_0: range 0 around 100 kHz, 0 WS
  *            RCC_MSIRANGE_1: range 1 around 200 kHz, 0 WS
  *            RCC_MSIRANGE_2: range 2 around 400 kHz, 0 WS
  *            RCC_MSIRANGE_3: range 3 around 800 kHz, 0 WS
  *            RCC_MSIRANGE_4: range 4 around 1 MHz, 0 WS
  *            RCC_MSIRANGE_5: range 5 around 2 MHz, 0 WS
  *            RCC_MSIRANGE_6: range 6 around 4 MHz, 0 WS  (reset value)
  *            RCC_MSIRANGE_7: range 7 around 8 MHz, 0 WS
  *            RCC_MSIRANGE_8: range 8 around 16 MHz, 0 WS
  *            RCC_MSIRANGE_9: range 9 around 24 MHz, 1 WS
  *            RCC_MSIRANGE_10: range 10 around 32 MHz, 1 WS
  *            RCC_MSIRANGE_11: range 11 around 48 MHz, 2 WS
  * @retval None
  */
static void SystemClock_MSI_Vrange_1(uint32_t msi_range)
{
  uint32_t flash_latency;

  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  
  /* Enable Power Control clock and switch to Range 1 before doing any other things */
  __HAL_RCC_PWR_CLK_ENABLE();
  
  /* The voltage scaling allows optimizing the power consumption when the device is 
     clocked below the maximum system frequency, to update the voltage scaling value 
     regarding system frequency refer to product datasheet.  */
  HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1);
  
  /* Disable Power Control clock */
  __HAL_RCC_PWR_CLK_DISABLE();

  /* Enable MSI Oscillator */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_MSI;
  RCC_OscInitStruct.MSIState = RCC_MSI_ON;
  RCC_OscInitStruct.MSIClockRange = msi_range;
  RCC_OscInitStruct.MSICalibrationValue=0x00;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct)!= HAL_OK)
  {
    /* Initialization Error */
    while(1); 
  }

  /* Select MSI as WakeUp clock */
  CLEAR_BIT(RCC->CFGR, RCC_CFGR_STOPWUCK_Msk);

  flash_latency=FLASH_LATENCY_0;

  switch ( msi_range ) {
    case RCC_MSIRANGE_9: 
    case RCC_MSIRANGE_10: 
        flash_latency=FLASH_LATENCY_1; break;
    case RCC_MSIRANGE_11: 
        flash_latency=FLASH_LATENCY_2; break;
  }

