rainer20512/stm32-fw/stm32l4/Src/system/clockconfig.c
  /* Enable Power Control clock */
  __HAL_RCC_PWR_CLK_ENABLE();
  
  /* Select Voltage Scale1  */
  HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1);
  
  /* Disable Power Control clock */
  __HAL_RCC_PWR_CLK_DISABLE();

  SC_SwitchOnHSI();

  /* Disable MSI Oscillator, if desired */
  if ( bSwitchOffMSI ) {
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_MSI;
    RCC_OscInitStruct.MSIState = RCC_MSI_OFF;
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct)!= HAL_OK)
    {
      /* Initialization Error */
      while(1); 
    }
  }
  /* Select HSI16 also as WakeUp clock */
  SET_BIT(RCC->CFGR, RCC_CFGR_STOPWUCK_Msk);
}

#if USE_USB > 0
    /**************************************************************************
     * PLL clock has been set up as system clock. During setup, output of the
     * PLL's M-divider has been set to  PLL_BASE_FRQ
     *************************************************************************/
    static void SetupUSB48Clk(void)
    {
    }
#endif

/******************************************************************************
 * configure PLL on HSI16 bas to xxmhz Mhz and switch on PLL
 *****************************************************************************/
static void SwitchOnPLL ( uint32_t xxmhz )
{
  uint32_t pllsrc;
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};

  /* 
   * if PLL is already selected as system clock source, 
   * it must be disabled before reconfiguration 
   */
  if (  __HAL_RCC_GET_SYSCLK_SOURCE() == RCC_CFGR_SWS_PLL ) {
    /* if so, select HSI as temporary system clock source       */
    /* Vrange and Wait states have been set by caller */
    SC_SwitchOnHSI();
  }

  #if USE_USB > 0
      CLEAR_BIT(RCC->CR, RCC_CR_PLLSAI1ON_Msk);
  #endif

  /* if HSE oscillator is equipped, use as PLL input, otherwise use HSI16 */
  #if defined(PLL_INP_FRQ) 
    #undef PLL_INP_FRQ
  #endif

  #if defined(HW_HAS_LSE)
    SwitchOnHSE();
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState = RCC_HSE_ON;
    pllsrc = RCC_PLLSOURCE_HSE;
    #define PLL_INP_FRQ  LSE_FREQUENCY
  #else
      RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
      RCC_OscInitStruct.HSIState = RCC_HSI_ON;
      RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT; 
      pllsrc = RCC_PLLSOURCE_HSI;
      #define PLL_INP_FRQ 16000000
  #endif

  /* 
   * PLLN is computed so, that the output after M-Divider is at 8MHz.
   * Check, whether this can be achieved
   */
  #define PLL_DIVM          (PLL_INP_FRQ/PLL_BASE_FRQ) 
  #if PLL_DIVM * PLL_BASE_FRQ != PLL_INP_FRQ
    #error "PLLM is not an integer value - cannot set PLLM"
  #endif  
  /* Enable  PLL */

  RCC_OscInitStruct.PLL.PLLSource = pllsrc;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;   
  RCC_OscInitStruct.PLL.PLLM = PLL_DIVM;
  RCC_OscInitStruct.PLL.PLLN = xxmhz / 2 ;
  RCC_OscInitStruct.PLL.PLLR = 4;
  RCC_OscInitStruct.PLL.PLLP = 17;
  RCC_OscInitStruct.PLL.PLLQ = 8;
   
   if (HAL_RCC_OscConfig(&RCC_OscInitStruct)!= HAL_OK)
  {
    /* Initialization Error */
    while(1); 
  }

  #if USE_USB > 0
    /* PLLSAI1 Q output to 48 MHz */
    RCC->PLLSAI1CFGR = 
        24 << RCC_PLLSAI1CFGR_PLLSAI1N_Pos |       /* PLLSAI1N = 24          */
      0b01 << RCC_PLLSAI1CFGR_PLLSAI1Q_Pos |       /* PLLSAI1Q = 4           */
      0b11 << RCC_PLLSAI1CFGR_PLLSAI1R_Pos |       /* PLLSAI1R = 8,  unused  */
         1 << RCC_PLLSAI1CFGR_PLLSAI1P_Pos |       /* PLLSAI1P = 17, unused  */
         1 << RCC_PLLSAI1CFGR_PLLSAI1QEN_Pos ;     /* Enable Q output        */
    
    /* Switch PLLSAI1 on and wait for ready */
    SET_BIT(RCC->CR, RCC_CR_PLLSAI1ON_Msk );
    while ( (RCC->CR & RCC_CR_PLLSAI1RDY_Msk ) == 0 );

    SC_SetUsbClockSource(RCC_USBCLKSOURCE_PLLSAI1);
  #endif
}

/*
 * The initialization part that has to be restored after wakeup from stop 
 */
static void SystemClock_PLL_xxMHz_Vrange_1_restore (uint32_t xxmhz, bool bSwitchOffMSI)
{
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
 
  uint32_t flash_latency = SystemClock_GetFlashLatency(1, xxmhz * 1000);
  SwitchOnPLL(xxmhz);
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_SYSCLK;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  HAL_RCC_ClockConfig(&RCC_ClkInitStruct, flash_latency );

  if ( bSwitchOffMSI ) {
    SwitchOffMSI();
  }
}

/**
  * @brief  System Clock Configuration on 32MhZ PLL-Clock, basing on 16MhZ HSI
  *         The system Clock is configured as follow : 
  *            System Clock source            = PLL Clock
  *            PLL input                      = 16MHz HSI RC-oscillator
  *            SYSCLK(Hz)                     = as desired, between 16 and 80 MHz
  *            HCLK(Hz)                       = as desired, between 16 and 80 MHz
  *            AHB Prescaler                  = 1
  *            APB1 Prescaler                 = 1
  *            APB2 Prescaler                 = 1
  *            Flash Latency(WS)              = depending from xxmhz, between 0 and 4
  *            Main regulator output voltage  = Scale1 mode
  *
  * 
  * @param  bSwitchOffMSI - Set to TRUE, if MSI Clock should be switched off. When going to sleep, MSI clock
  *         MUST be activated again, BEFORE going to sleep
  * @retval None
  */

static void SystemClock_PLL_xxMHz_Vrange_1(uint32_t xxmhz, bool bSwitchOffMSI)
{
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  uint32_t flash_latency = SystemClock_GetFlashLatency(1, xxmhz * 1000);

  /* Enable Power Control clock */
  __HAL_RCC_PWR_CLK_ENABLE();
  
  /* Select Voltage Scale1  */
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);
  
  /* Disable Power Control clock */
  __HAL_RCC_PWR_CLK_DISABLE();

  SwitchOnPLL(xxmhz);
  
  /* Select Pll as system clock source and configure the HCLK, PCLK1 and PCLK2 
     clocks dividers */
  RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;  
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, flash_latency )!= HAL_OK)
  {
    /* Initialization Error */
    while(1); 
  }

  #if USE_USB > 0
    SetupUSB48Clk();
  #endif

  /* Disable MSI Oscillator, if desired */
  if ( bSwitchOffMSI ) {
    SwitchOffMSI();
  }

  /* Select HSI16 also as WakeUp clock */
  SET_BIT(RCC->CFGR, RCC_CFGR_STOPWUCK_Msk);
}

static const uint16_t pll_clk_rates[] = {16,24,32,48,64,80};
/*******************************************************************************
 * Return the clock spped in MHz for a given CLK_CONFIG_T with PLL useage
 *******************************************************************************/
static uint16_t GetPLLClockRate( CLK_CONFIG_T clk_config_byte )
{
    if ( clk_config_byte < CLK_PLL_VRNG1_16MHZ_0WS || clk_config_byte > CLK_PLL_VRNG1_80MHZ_4WS ) 
        return 0;
    else   
        return pll_clk_rates[clk_config_byte - CLK_PLL_VRNG1_16MHZ_0WS];
}



/* Only use "SystemClock_SetConfiguredClock" to change system clock            */
/* THis will ensure, that all devices will be noticed about clock              */
/* changes                                                                     */
/*******************************************************************************
 * Do all the clock setting on a configuration byte basis
 *******************************************************************************/
void SystemClock_Set(CLK_CONFIG_T clk_config_byte, bool bSwitchOffMSI )
{
    /* 
     * When using USB, we need a 48MHz clock. This is generated from PLLSAI1
     * in any case. So we only allow clock settings, which are derived from PLL
     * This is not mandatory, but easier to handle
     * Only if the System clock is MSI48, we use this as USB clock, too
     */
    #if USE_USB > 0
        /* 
         * any clocksetting without PLL and != MSI48 will be changed to
         * MSI48, if USB is configured.
         */
        if ( clk_config_byte < CLK_MSI_VRNG1_48MHZ_2WS ) {
            DEBUG_PRINTF("Error: Clock config #%d not allowed with USB active. Setting SYSCLK to MSI48\n", clk_config_byte); 
            clk_config_byte = CLK_MSI_VRNG1_48MHZ_2WS;
        }
    #endif
    /* Save desired settings for restoration after Stop */
    saved_bSwitchOffMSI   = bSwitchOffMSI;

